app/controllers/cons_controller.rb

def create
	@dilema = Dilema.find(params[:dilema_id])
	@con = @dilema.cons.new(params[:con].permit(:name, :value))
  @dilema.con_total = @dilema.con_total + @con.value
  @dilema.save
---
SELECT "dilemas".* FROM "dilemas" WHERE "dilemas"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "cons" ("created_at", "dilema_id", "name", "updated_at", "value") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 10 Dec 2013 21:40:48 UTC +00:00], ["dilema_id", 2], ["name", "Chris Potentially"], ["updated_at", Tue, 10 Dec 2013 21:40:48 UTC +00:00], ["value", 1]]
UPDATE "dilemas" SET "con_total" = ?, "result" = ?, "updated_at" = ? WHERE "dilemas"."id" = 3  [["con_total", 2], ["result", 2], ["updated_at", Wed, 06 Nov 2013 07:34:10 UTC +00:00]]

def destroy
	@dilema = Dilema.find(params[:dilema_id])
	@con = @dilema.cons.find(params[:id])
	@dilema.con_total = @dilema.con_total - @con.value
  @dilema.save
	@con.destroy
---
SELECT "dilemas".* FROM "dilemas" WHERE "dilemas"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "cons".* FROM "cons" WHERE "cons"."dilema_id" = ? AND "cons"."id" = ? LIMIT 1  [["dilema_id", 3], ["id", "9"]]
UPDATE "dilemas" SET "con_total" = ?, "result" = ?, "updated_at" = ? WHERE "dilemas"."id" = 3  [["con_total", 2], ["result", 2], ["updated_at", Thu, 14 Nov 2013 21:46:48 UTC +00:00]]
DELETE FROM "cons" WHERE "cons"."id" = ?  [["id", 9]]