app/controllers/dilemas_controller.rb

def create
	@dilema = Dilema.new(dilema_params)
 	# @dilema.author = current_user.email
 	@dilema.user_id = current_user.id
 	@dilema.pro_total = 0
 	@dilema.con_total = 0
 	@dilema.result = '???'
  if @dilema.save
---
INSERT INTO "dilemas" ("created_at", "decision", "updated_at", "user_is") VALUES (?, ?, ?, ?)  [["created_at", Sat, 02 Nov 2013 04:37:24 UTC +00:00], ["decision", "Should I get a hair cut?"], ["updated_at", Sat, 02 Nov 2013 04:37:24 UTC +00:00], ["user_is", 1]]

def show
	@dilema = Dilema.find(params[:id])
	result = @dilema.pro_total - @dilema.con_total
	if result > 0
	  @dilema.result = "PRO " + result.to_s
  end
  if result < 0
    @dilema.result = "CON " + result.abs.to_s
  end
  if result == 0
    @dilema.result = "??? 0"
  end
  @dilema.save
---
SELECT "dilemas".* FROM "dilemas" WHERE "dilemas"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "dilemas" SET "result" = ?, "updated_at" = ? WHERE "dilemas"."id" = 6  [["result", "PRO 2"], ["updated_at", Tue, 05 Nov 2013 04:03:09 UTC +00:00]]

def index
	@dilemas = Dilema.where(user_id: current_user.id)
---
SELECT "dilemas".* FROM "dilemas" WHERE "dilemas"."user_id" = 1

def destroy
	@dilema = Dilema.find(params[:id])
	@dilema.destroy
---
SELECT "dilemas".* FROM "dilemas" WHERE "dilemas"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "dilemas" WHERE "dilemas"."id" = ?  [["id", 3]]