app/controllers/pros_controller.rb

SELECT "dilemas".* FROM "dilemas" WHERE "dilemas"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "pros" ("created_at", "dilema_id", "name", "updated_at", "value") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 10 Dec 2013 21:40:23 UTC +00:00], ["dilema_id", 2], ["name", "Gamez is teh best"], ["updated_at", Tue, 10 Dec 2013 21:40:23 UTC +00:00], ["value", 5]]
UPDATE "dilemas" SET "pro_total" = ?, "result" = ?, "updated_at" = ? WHERE "dilemas"."id" = 3  [["pro_total", 1], ["result", 1], ["updated_at", Wed, 06 Nov 2013 07:27:50 UTC +00:00]]
---
def create
	@dilema = Dilema.find(params[:dilema_id])
	@pro = @dilema.pros.new(params[:pro].permit(:name, :value))
	@dilema.pro_total = @dilema.pro_total + @pro.value
  @dilema.save

SELECT "dilemas".* FROM "dilemas" WHERE "dilemas"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "pros".* FROM "pros" WHERE "pros"."dilema_id" = ? AND "pros"."id" = ? LIMIT 1  [["dilema_id", 4], ["id", "1"]]
DELETE FROM "pros" WHERE "pros"."id" = ?  [["id", 1]]
---
def destroy
	@dilema = Dilema.find(params[:dilema_id])
	@pro = @dilema.pros.find(params[:id])
	@dilema.pro_total = @dilema.pro_total - @pro.value
	@dilema.save
	@pro.destroy