app/views/dilemas/show.html.erb

SELECT "pros".* FROM "pros" WHERE "pros"."dilema_id" = ?  [["dilema_id", 4]]
---
  </tr>
  <% @dilema.pros.each do |pro| %>

SELECT "cons".* FROM "cons" WHERE "cons"."dilema_id" = ?  [["dilema_id", 4]]
---
  </tr>
  <% @dilema.cons.each do |con| %>